import 'package:flutter/material.dart';

class LanguagePage extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text(
          "اللغات",
          style: TextStyle(fontSize: 24),
        ),
        backgroundColor: Colors.blue[50],
        centerTitle: true,
      ),
      body: Container(
        color: Colors.blue[50],
        child: GridView.count(
          crossAxisCount: 1,
          children: [
            buildLanguageCard(
                "Flutter",
                "هي لغة برمجة واجهة مستخدم مفتوحة المصدر ومتعددة المنصات، تم تطويرها بواسطة شركة , ظهرت فكرة فلاتر لأول مرة في مؤتمر مطوري جوجل في عام 2015 ، يعتبر فلاتر فعالًا لتطوير تطبيقات متعددة المنصات، مما يعني أنه يمكنك كتابة تطبيق واحد باستخدام فلاتر وتشغيله على مختلف الأنظمة التشغيلية مثل ايفون و اندرويد، وحتى ويندوز وماك , تتميز فلاتر بأدائها العالي وسرعتها، حيث تستخدم تقنية تُدعى محرك رسومات سكي الرسم واجهات المستخدم بشكل سلس وسريع.",
                context),
            buildLanguageCard(
                "Java",
                "جافا هي لغة برمجة عالية المستوى ومتعددة الأغراض، وأُصدرت لأول مرة في عام 1995. تُستخدم بشكل واسع لتطوير تطبيقات الويب، تطبيقات الأندرويد، أنظمة الشركات، وألعاب الفيديو. تتميز بالكتابة الثابتة والقوية، والقدرة على التشغيل على أي منصة , شعارها الشهير هو اكتب مرة، شغّل في أي مكان، مما يعكس قدرتها على العمل عبر أنظمة تشغيل متعددة بدون تعديل الكود.",
                context),
            buildLanguageCard(
                "C++",
                "هي لغة برمجة متعددة الأغراض تم تطويرها من قبل بيارن ستروستروب في أوائل الثمانينات. تعتبر تطويرًا للغة سي، مع إضافة ميزات البرمجة الكائنية، مما يجعلها أكثر قوة ومرونة. تستخدم على نطاق واسع في مجموعة متنوعة من التطبيقات، بدءًا من تطوير الألعاب وصولًا إلى برمجة أنظمة التشغيل , تُعتبر من بين اللغات التي توفر الكفاءة العالية والأداء الممتاز، مما يجعلها مثالية لتطوير التطبيقات التي تتطلب سرعة وأداءًا فائقًا، مثل الألعاب والبرامج المدمجة. ",
                context),
            buildLanguageCard(
                "C#",
                "هي لغة برمجة قوية ومتعددة الاستخدامات ظهرت لأول مرة عام 2000 بواسطة مايكروسوفت ,  تم تطويرها كجزء من منصة , لتوفير بيئة برمجية متكاملة لتطوير تطبيقات الويب والسطح المكتبي وحتى تطبيقات الألعاب. تتميز بميزات قوية مثل الكتابة الثابتة، والتحكم في الذاكرة، والدعم لبرمجة الكائنات، مما يجعلها خيارًا شائعًا بين المطورين. تستخدم بشكل واسع في صناعة تطوير البرمجيات وتقديم حلول تقنية مبتكرة وفعالة.",
                context),
            buildLanguageCard(
                "JavaScript",
                "هي لغة برمجة تفاعلية تستخدم على نطاق واسع في تطوير تطبيقات الويب. ظهرت لأول مرة في منتصف التسعينيات وأصبحت أحد أساسيات تطوير الويب الحديث , تتميز بقدرتها على تحسين تفاعل المستخدم مع صفحات الويب، إضافة الديناميكية، وتوفير تجارب مستخدم ممتعة ومبتكرة ,  تُستخدم أيضًا في تطوير تطبيقات الويب الأحادية الصفحة وتطبيقات الهجين وحتى في تطوير تطبيقات الخادم من خلال إطار عمل نود جي اس",
                context),
            buildLanguageCard(
                "Dart",
                "هي لغة برمجة مفتوحة المصدر تم تطويرها بواسطة جوجل، وهي تستخدم بشكل أساسي في تطوير تطبيقات الويب والموبايل. تتميز بسهولة التعلم والاستخدام، وتوفر أداءً عاليًا لتطبيقاتها. تستخدم بشكل رئيسي مع إطار العمل فلاتر، والذي يسمح ببناء واجهات مستخدم جميلة ومتطورة بطريقة سهلة وفعالة.",
                context),
            buildLanguageCard(
                "Python",
                "هي لغة برمجة تم تطويرها لتكون سهلة التعلم والاستخدام، مع توفير قدر كبير من المرونة والقوة. تتميز ببنية بسيطة وقريبة من اللغة الإنسانية، مما يجعلها مثالية للمبتدئين والمحترفين على حد سواء. بفضل مجتمعها القوي والنشط، توفر مجموعة واسعة من المكتبات والأدوات التي تسهل عملية تطوير التطبيقات في مجموعة متنوعة من المجالات، مثل تطوير الويب، وتحليل البيانات، والذكاء الاصطناعي، وغيرها. بالإضافة إلى ذلك، تعتبر مفتوحة المصدر،",
                context),
            buildLanguageCard(
                "Kotlin",
                "هي لغة برمجة تم تطويرها من قبل شركة جيت براينس لتكون بديلاً ممتازًا للغة جافا في تطوير تطبيقات الأندرويد. تمتلك بنية بسيطة ونظيفة تجعلها سهلة التعلم والاستخدام، كما تتميز بقوة ومرونة تسمح بكتابة الكود بطريقة أكثر فعالية وسلاسة. بفضل دعم مجتمعها المتزايد، توفر اللغة مجموعة واسعة من الميزات والمكتبات التي تسهل عملية تطوير التطبيقات في مختلف المجالات، مثل تطوير الويب والأندرويد وتطبيقات سطح المكتب. كما أن مفتوحة المصدر، ",
                context),
            buildLanguageCard(
                "PHP",
                "هي لغة برمجة نصية تُستخدم بشكل رئيسي لتطوير تطبيقات الويب وبناء المواقع الديناميكية. تتميز بسهولة تعلمها واستخدامها، مما جعلها شديدة الشعبية في مجال تطوير الويب. توفر مجموعة واسعة من الميزات والوظائف التي تسهل عملية بناء تطبيقات الويب بشكل سريع وفعال، مثل إمكانية الاتصال بقواعد البيانات، وإنشاء صفحات الويب الديناميكية، وإرسال البريد الإلكتروني، والتعامل مع الصور والملفات، وغيرها",
                context),
            buildLanguageCard(
                "Swift",
                "هي لغة برمجة طورتها ابل تتميز بالأداء العالي والأمان، مع بنية سهلة التعلم والفهم. توفر ميزات متقدمة مثل التعامل مع البيانات، والتعبيرات الشرطية، والدوال، والتعامل مع الكائنات، وغيرها، مما يسهل على المطورين بناء تطبيقات متطورة بشكل فعال وسلس. بفضل دعمها الكامل من قبل ، توفر تجربة تطوير متكاملة لمنصاتها.",
                context),
          ],
        ),
      ),
    );
  }

  Widget buildLanguageCard(
      String language, String description, BuildContext context) {
    return Card(
      color: Colors.blue[100],
      child: Padding(
        padding: const EdgeInsets.all(16.0),
        child: Column(
          crossAxisAlignment: CrossAxisAlignment.center,
          children: [
            Text(
              language,
              style: TextStyle(fontSize: 24, fontWeight: FontWeight.bold),
              textAlign: TextAlign.right,
            ),
            SizedBox(height: 10),
            Text(
              description,
              style: TextStyle(fontSize: 16),
              textAlign: TextAlign.right,
            ),
          ],
        ),
      ),
    );
  }
}
